// API URLは共通のため、ここで定義しておく
// 定義共用的API
const api = "https://raw.githubusercontent.com/hexschool/2021-ui-frontend-job/master/frontend_data.json";



// ==================================================
// 題目一：各學歷人數
// ==================================================
const educationList = () => {
    async function fetchData() {
        try {
            let response = await fetch(api); // APIを呼び出す
            let jsonData = await response.json(); // JSON 形式のデータに変換する

            // 各學歴の人数を集計
            let educationCount = jsonData.reduce((count, item) => {
                count[item.education] = (count[item.education] || 0) + 1;
                return count;
            }, {}); // 初期値は空のオブジェクト

            console.log(educationCount);

        } catch (error) { // エラー発生時の処理
            console.error(error);
        }
    }
    fetchData();
};
educationList();

// ==================================================
// 題目二： 各地區工作人士佔比人數
// ==================================================

// ==================================================
// 題目三：26~30 年齡族群的平均薪水滿意度為？
// ==================================================

// ==================================================
// 題目四：產業簽到區有寫與沒寫的人數比例為？
// ==================================================

// ==================================================
// 題目五：各產業的實體與遠端人數
// ==================================================

// ==================================================
// 題目六：各產業的男女性比例，與產業滿意度
// ==================================================

// ==================================================
// 題目七：各年資的實體與遠端工作，平均薪水滿意度為？
// ==================================================